tap "homebrew/bundle"
tap "homebrew/services"
tap "jozefcipa/novus"
tap "guumaster/tap"
tap "nektos/tap"

# GNU File, Shell, and Text utilities
brew "coreutils"
# Collection of GNU find, xargs, and locate
brew "findutils"

# Run your GitHub Actions locally
brew "act"
# Download with resuming and segmented downloading
brew "aria2"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS Client for Humans
brew "doggo"
# Run arbitrary commands when files change
brew "entr"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# dotfiles management
brew "stow"
# Render markdown on the CLI
brew "glow"
# Ping, but with a graph
brew "gping"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Clone of cat with syntax highlighting and Git integration
brew "bat"
# Like cURL, but for gRPC
brew "grpcurl"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Vi 'workalike' with many additional features
brew "vim"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Your dev tool to manage /etc/hosts like a pro
brew "guumaster/tap/hostctl"
# A local HTTPS proxy for a delightful developer experience.
brew "jozefcipa/novus/novus"
# Android SDK component
cask "android-platform-tools"
# Docker-desktop
cask "docker"
# Fonts
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-jetbrains-mono-nerd-font"
# Clipboard manager
cask "maccy"
# Visual diff and merge tool
cask "meld"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Menu bar pomodoro timer
cask "tomatobar"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Free and open-source media player
cask "iina"