jorgebucaran/fisher
LumaKernel/fish-fd-complete
ivakyb/fish_ssh_agent
catppuccin/fish
edc/bass
rstacruz/fish-asdf
franciscolourenco/done
patrickf1/fzf.fish
patrickf1/colored_man_pages.fish
ilancosman/tide@v6
